# CircleUnbounded Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..CircleUnbounded Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
An unbounded circle can only be used to construct a spiral shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircleUnbounded { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircleUnbounded As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircleUnbounded {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace